tsung/browse_services.xml
<?xml version="1.0"?>
<!DOCTYPE tsung SYSTEM "/usr/local/share/tsung/tsung-1.0.dtd" [] >
<tsung loglevel="notice">
  <clients>
    <client host="localhost" maxusers="130000" use_controller_vm="true" />
  </clients>

  <servers>
    <server host="kerem.eba-8zhfquyf.us-west-2.elasticbeanstalk.com" port="80" type="tcp"></server>
  </servers>

  <load>
    <arrivalphase phase="1" duration="200" unit="second" wait_all_sessions_end="true">
      <users arrivalrate="100" unit="second"></users>
    </arrivalphase>
    <arrivalphase phase="2" duration="200" unit="second" wait_all_sessions_end="true">
      <users arrivalrate="400" unit="second"></users>
    </arrivalphase>
    <arrivalphase phase="3" duration="200" unit="second" wait_all_sessions_end="true">
      <users arrivalrate="1600" unit="second"></users>
    </arrivalphase>
    <arrivalphase phase="4" duration="200" unit="second" wait_all_sessions_end="true">
      <users arrivalrate="6400" unit="second"></users>
    </arrivalphase>
    <arrivalphase phase="5" duration="200" unit="second" wait_all_sessions_end="true">
      <users arrivalrate="25600" unit="second"></users>
    </arrivalphase>
  </load>

  <options>
    <!-- Set connection timeout to 2 seconds -->
    <option name="global_ack_timeout" value="2000"></option>
  </options>

  <sessions>
    <session name="main" type="ts_http" weight="1">
      <transaction name="browse">
        <request> <http url='/' version='1.1' method='GET'></http> </request>

        <for from="1" to="50" incr="1" var="counter">
          <setdynvars sourcetype="random_number" start="1" end="9999">
            <var name="next_page" />
          </setdynvars>

          <thinktime value="2" random="true"></thinktime>
          <request subst="true"> <http url='/?page=%%_next_page%%' version='1.1' method='GET'></http> </request>
        </for>

      </transaction>
    </session>
  </sessions>
</tsung>