tsung/tsung_book_rate_client.xml
<?xml version="1.0"?>
<!DOCTYPE tsung SYSTEM "/usr/local/share/tsung/tsung-1.0.dtd" [] >
<tsung loglevel="notice">
  <clients>
    <client host="localhost" maxusers="32768" use_controller_vm="true" />
  </clients>

  <servers>
    <server host="kokinarimoto.eba-8zhfquyf.us-west-2.elasticbeanstalk.com" port="80" type="tcp"></server>
  </servers>

  <load>
    <arrivalphase phase="1" duration="200" unit="second" wait_all_sessions_end="true">
      <users arrivalrate="10" unit="second"></users>
    </arrivalphase>
    <arrivalphase phase="2" duration="200" unit="second" wait_all_sessions_end="true">
      <users arrivalrate="20" unit="second"></users>
    </arrivalphase>
    <arrivalphase phase="3" duration="200" unit="second" wait_all_sessions_end="true">
      <users arrivalrate="40" unit="second"></users>
    </arrivalphase>
    <arrivalphase phase="4" duration="200" unit="second" wait_all_sessions_end="true">
      <users arrivalrate="80" unit="second"></users>
    </arrivalphase>
    <arrivalphase phase="5" duration="200" unit="second" wait_all_sessions_end="true">
      <users arrivalrate="160" unit="second"></users>
    </arrivalphase>
  </load>

  <options>
    <!-- Set connection timeout to 2 seconds -->
    <option name="global_ack_timeout" value="2000"></option>
    <!-- available client ports to run concurrent connections -->
    <!-- <option name="ports_range" min="1025" max="65535"/> -->

    <!-- <option name="file_server" id="users" value="users.csv"/>
    <option name="file_server" id="services" value="services.csv"/> -->
  </options>

<!--Scenario: Log in / See and Find a Service / Book a Service / Choose Availability / Logout-->
<sessions>
    <session name="booking" probability="100" type="ts_http">
      <transaction name="book_rate_service">

        <!-- create a random user_id -->
        <setdynvars sourcetype="random_number" start="1" end="10">
          <var name="user_id" />
        </setdynvars>
        
        <setdynvars sourcetype="random_string" length="15"> <var name="service_suffix" /> </setdynvars>
        
        <!-- start out at the root but send to login ->register -->
        <request> <http url='/' version='1.1' method='GET'></http> </request>
        <request> <http url='/login' version='1.1' method='GET'></http> </request>
        
        <!-- wait for up to 2 seconds, user is thinking about login info -->
        <thinktime value="2" random="true"></thinktime>
        <request subst="true">
          <http 
            url="/login" 
            method="POST" 
            version="1.1" 
            contents="login[username]=test_user_%%_user_id%%&amp;
                login[password]=password&amp;
                commit=Log in" 
            content_type="application/x-www-form-urlencoded" />
        </request>
        <request> <http url='/' version='1.1' method='GET'></http> </request>

        <!-- get random service -->
        <thinktime value="2" random="true"></thinktime>
        <setdynvars sourcetype="random_number" start="1" end="100000">
          <var name="service_id" />
        </setdynvars>

        <!-- leave rating for service -->
        <request subst = "true"> <http url='/services/%%_service_id%%' version='1.1' method='GET'></http>  </request>
        <thinktime value="1" random="true"></thinktime>
        <request subst = "true"> <http url='/services/%%_service_id%%/reviews' version='1.1' method='GET'></http>  </request>
        <thinktime value="1" random="true"></thinktime>
        <request subst = "true"> <http url='/services/%%_service_id%%/reviews/new' version='1.1' method='GET'></http>  </request>
        
        <thinktime value="5" random="true"></thinktime>
        <request subst="true">
          <http 
            url="/services/%%_service_id%%/reviews" 
            method="POST" 
            version="1.1" 
            contents="review[rating]=1&amp;
                review[review]=%%_random_string%%&amp;
                commit=Create+Review" 
            content_type="application/x-www-form-urlencoded" />
        </request>

        <request subst = "true"> <http url='/services/%%_service_id%%/reviews' version='1.1' method='GET'></http>  </request>

        <!-- Log out -->
        <request>
          <http 
            url="/logout" 
            method="POST" 
            version="1.1" 
            contents="_method=delete" 
            content_type="application/x-www-form-urlencoded" />
        </request>

      </transaction>
    </session>
  </sessions>
</tsung>