tsung/tsung_service.xml
<?xml version="1.0"?>
<!DOCTYPE tsung SYSTEM "/usr/local/share/tsung/tsung-1.0.dtd" [] >
<tsung loglevel="notice">
  <clients>
    <client host="localhost" maxusers="32768" use_controller_vm="true" />
  </clients>

  <servers>
    <server host="koki.eba-8zhfquyf.us-west-2.elasticbeanstalk.com" port="80" type="tcp"></server>
  </servers>

  <load>
   <arrivalphase phase="1" duration="200" unit="second" wait_all_sessions_end="true">
      <users arrivalrate="10" unit="second"></users>
    </arrivalphase>
    <arrivalphase phase="2" duration="200" unit="second" wait_all_sessions_end="true">
      <users arrivalrate="20" unit="second"></users>
    </arrivalphase>
    <arrivalphase phase="3" duration="200" unit="second" wait_all_sessions_end="true">
      <users arrivalrate="40" unit="second"></users>
    </arrivalphase>
    <arrivalphase phase="4" duration="200" unit="second" wait_all_sessions_end="true">
      <users arrivalrate="80" unit="second"></users>
    </arrivalphase>
    <arrivalphase phase="5" duration="200" unit="second" wait_all_sessions_end="true">
      <users arrivalrate="160" unit="second"></users>
    </arrivalphase>
  </load>

  <options>
    <!-- Set connection timeout to 2 seconds -->
    <option name="global_ack_timeout" value="2000"></option>
  </options>

  <sessions>
    <session name="services" type="ts_http" weight="1">
      <transaction name="create_service">
        
        <!-- create a random user_id -->
        <setdynvars sourcetype="random_number" start="1" end="10">
          <var name="user_id" />
        </setdynvars>

        <setdynvars sourcetype="random_string" length="15"> 
          <var name="service_suffix" /> 
        </setdynvars>
        <!-- <setdynvars sourcetype="random_string" length="15"> 
          <var name="service_suffix_2" /> 
        </setdynvars>         -->

        <request> <http url='/' version='1.1' method='GET'></http> </request>
        <request> <http url='/login' version='1.1' method='GET'></http> </request>

        <thinktime value="2" random="true"></thinktime>
        <request subst="true">
          <http 
            url="/login" 
            method="POST" 
            version="1.1" 
            contents="login[username]=test_user_%%_user_id%%&amp;
                login[password]=password&amp;
                commit=Log in" 
            content_type="application/x-www-form-urlencoded" />
        </request>

        <request> <http url='/' version='1.1' method='GET'></http> </request>
        
        <!-- click create a service -->
        <request> <http url="/services/new" method="GET" version="1.1" /> </request>

        <!-- Wait while user fills out 'new services' form -->
        <thinktime value="3" random="true"></thinktime>

        <!-- submit 'new services' form -->
        <request subst="true">
          <dyn_variable name="services_redirect" re="[Ll]ocation: (.*)\r" />
          <http 
            url="/services" 
            method="POST" 
            version="1.1" 
            contents="service[title]=Dog Grooming by %%_user_id%%days&amp;
                      service[description]Dog Grooming %%_service_suffix%%&amp;
                      commit=Create+Service"
            content_type="application/x-www-form-urlencoded" />
        </request>

        <!-- follow redirect -->
        <request subst="true"> <http url="%%_services_redirect%%" method="GET" version="1.1" /> </request>
        <!-- <request subst="true"> <http url="%%_services_redirect%%/edit" method="GET" version="1.1" /> </request> -->
        
        <!-- submit 'edit services' form -->
        <!-- <thinktime value="3" random="true"></thinktime>
        <request subst="true">
          <http 
            url="%%_services_redirect%%/edit" 
            method="POST" 
            version="1.1" 
            contents="service[title]=Dog Grooming by %%_user_id%%days&amp;
                      service[description]=Dog Grooming %%_service_suffix_2%%&amp;
                      commit=Create+Service"
            content_type="application/x-www-form-urlencoded" />
        </request> -->
        <!-- <request subst="true"> <http url="%%_services_redirect%%" method="GET" version="1.1" /> </request> -->
        
        <!-- Delete service -->
        <request subst="true">
          <http 
            url="%%_services_redirect%%" 
            method="DELETE" 
            version="1.1" 
            content_type="application/x-www-form-urlencoded" />
        </request>

        <request> <http url="/services" method="GET" version="1.1" /> </request>

        <!-- Log out -->
        <request>
          <http 
            url="/logout" 
            method="POST" 
            version="1.1" 
            contents="_method=delete" 
            content_type="application/x-www-form-urlencoded" />
        </request>

      </transaction>
    </session>
  </sessions>
</tsung>